{
  "basics": {
    "name": "Muhammad Zahid Naeem",
    "label": "Research Scientist",
    "image": "",
    "email": "drmznaeem.eco@pu.edu.pk",
    "phone": "",
    "Bio": "I am Experienced in multidisciplinary research with proficiency in Development economics, financial economics with focus on financial crises.",
    "location": {
      "address": "Quaid e Azam Campus",
      "postalCode": "56000",
      "city": "Lahore",
      "countryCode": "Pakistan",
      "region": "Punjab"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Zahid_Naeem",
        "url": "https://www.linkedin.com/in/dr-muhammad-zahid-naeem-b71a7a83/"
      }
    ]
  },
  "work": [
    {
      "name": "University of the Punjab, Lahore",
      "position": "Assistant Professor",
      "url": "",
      "startDate": "2016-08-05",
      "endDate": "2018-02-15",
      "summary": "Economics",
      "highlights": [
        "Delivered graduate and postgraduate courses in management and social sciences.
 Focused on inclusive teaching methods during the lectures.
 Supervised thesis and research projects, guiding students on contemporary issues in management and business strategies.
 Conducted interdisciplinary research, publishing findings in peer-reviewed journals and presenting at international
conferences.
 Engaged in curriculum development, ensuring course content aligned with industry standards and accreditation requirements.
 Actively participated in departmental committees to enhance academic policies, student engagement, and program quality.
 Collaborated with industry partners to create internship and placement opportunities for students, bridging academia and practice.
 Organised workshops and seminars on leadership, innovation, and business trends to enrich student learning experiences.
 Mentored junior faculty members, contributing to their professional development and teaching effectiveness."
      ]
    },
    
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Urdu",
      "fluency": "Native Speaker",
      "icon": ""
    },
    {
      "language": "Punjabi",
      "fluency": "Native Speaker",
      "icon": ""
    }
    {
      "language": "Turkish",
      "fluency": "A1 Level",
      "icon": ""
    }
  ]
}
